aerofoil_60ms_2deg/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  12
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          GAMG;
        smoother        DIC;

        tolerance       1e-8;
        relTol          0.01;
    }

    "(U|k|omega|h)"
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-10;
        relTol          0.1;
    }
}

PIMPLE
{
    residualControl
    {
        p               1e-6;
        U               1e-5;
        "(k|omega|h)"   1e-5;
    }

    nNonOrthogonalCorrectors 0;
}

relaxationFactors
{
    fields
    {
        p               0.3;
        rho             0.01;
    }

    equations
    {
        U               0.7;
        h               0.7;
        "(k|omega)"     0.7;
    }
}

// ************************************************************************* //
